Revit 2026 API

# GlobalParameterIsValidFormula Method

---

Tests that the given expression is a valid as formula for this parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidFormula(
	string expression
)
```
```vb
Public Function IsValidFormula (
	expression As String
) As Boolean
```
```cpp
public:
bool IsValidFormula(
	String^ expression
)
```
```fsharp
member IsValidFormula :
        expression : string -> bool
```

#### Parameters

expression String

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Use this method to test validity of a formula before assigning it to a global parameter when in doubt whether it is an acceptable expression or not.

#### Reference

GlobalParameter Class

Autodesk.Revit.DB Namespace